---
type: TilePatterns
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# TilePatterns

`Autodesk.Revit.DB.TilePatterns` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetTilePattern | — | `public TilePattern GetTilePattern ( TilePatternsBuiltIn tilePatternBuiltIn )` |